In [ ]:
import pandas as pd
import numpy as np

We use pandas read_csv function to read the csv file in pyhton and pandas DataFrame method to convert the file into the data frame

In [ ]:
df=pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.shape
df.shape[0]

891

HANDELING NULL VALUES

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Seperating out the coloumns which have more than 35% of the values missing in the dataset

In [ ]:
x=df.isnull().sum()
#It is as a boolean expresion
# Shape[0] we are using to get 35%
drop_col=x[x>(35/100*df.shape[0])]

drop_col

Cabin    687
dtype: int64

In [ ]:
drop_col.index

Index(['Cabin'], dtype='object')

Now we are droping the coloumn as it had not specified more that 35%

In [ ]:
df.drop(drop_col.index, axis=1, inplace=True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [ ]:
#df.fillna will fill a specific number to all columns to all the null values
# that value is mean , now average of age will be filled in null values
df.fillna(df.mean(),inplace=True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

Embarked is still there as it is of String type

In [ ]:
df['Embarked'].describe()
# this will tell total about that

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

count is for no null values
unique tells us no.of unique values in Embaeked(S,C,Q)
top returns which one has heighest
freq returns the no.of accurnce of S

for Embarked attribute, we fill the NULL values with the most frequent value in the column

In [ ]:
df['Embarked'].fillna('S',inplace=True)

In [ ]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

Now we have no null values

now let see about corelation

In [ ]:
df.corr()
# propertonality between then in graph if same line then correlation is more

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

diagonals are all one so corellation is more

Conclusion  1)is here Fare is increasing with Pclass level increases

sibsp: Number of Siblings/Spouses Abourd 

parch: Number of Parents/Childrens abourd

In [ ]:
df['FamilySize']=df['SibSp']+df['Parch']
df.drop(['SibSp','Parch'], axis=1, inplace=True)
df.corr()
# We are droping Sibsp & Parch as we added them in FamilySize

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658   -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307    0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500    0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566   -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000    0.217138
FamilySize     -0.040143  0.016639  0.065997 -0.248512  0.217138    1.000000

Family size not survived here

Conclusion 2)
Lower Pclass survived more

In [ ]:
df['Alone']=[0 if df['FamilySize'][i]>0 else 1 for i in df.index]
df.head()
# Creating another parameter Alone & it is zero if family size greater than zero & one if less than zero
# family size is grater than zero than not alone

   PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0            1         0       3  ...        S          1      0
1            2         1       1  ...        C          1      0
2            3         1       3  ...        S          0      1
3            4         1       1  ...        S          1      0
4            5         0       3  ...        S          0      1

[5 rows x 11 columns]

In [ ]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

 conclusion 3)
 If the person is alone then he has less chance to survive

In [ ]:
df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

Conclusion4)
If person is Alone then less perice

In [ ]:
df['Sex'] = [0 if df['Sex'][i]=='male' else 1 for i in df.index] # 
# 1 for female & 0 for male
df.groupby(['Sex'])['Survived'].mean()

Sex
1    0.383838
Name: Survived, dtype: float64

In [ ]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

People who has Emarcation port as C are more prone to Survive
minimum for S

CONCLUSION

-> Female passengers were prioritized.

-> People with high class or rich people have heiger chance to survive than others.

-> Passengers travelling with their family have higer survival rate.

-> Passengers who borded the ship at Cherbourg,Survived more in proportion then the others.